import * as Yup from 'yup';
export const registrationFormSchema = Yup.object().shape({
  firstname: Yup.string()
    .required('Անունը պարտադիր է')
    .min(3, 'Անունը պետք է ունենա առնվազն 3 տառ')
    .max(16, 'Անունը չպետք է լինի ավելի քան 16 տառ'),
  lastname: Yup.string()
    .required('Ազգանունը պարտադիր է')
    .min(3, 'Ազգանունը պետք է ունենա առնվազն 3 տառ')
    .max(26, 'Ազգանունը չպետք է լինի ավելի քան 26 տառ'),
  username: Yup.string()
    .required('Մուտքանունը պարտադիր է')
    .min(5, 'Մուտքանունը պետք է ունենա առնվազն 5 տառ')
    .max(16, 'Մուտքանունը չպետք է լինի ավելի քան 16 տառ')
    .matches(/^[a-zA-Z0-9]+$/, 'Մուտքանունը պետք է պարունակի միայն անգլերեն տառեր և թվեր'),
  phone: Yup.string()
    .required('Հեռախոսահամարը պարտադիր է')
    .min(9, 'Հեռախոսահամարը չի համապատասխանում ՀՀ ձևաչափին'),
  password: Yup.string()
    .matches(/\w*[a-z]\w*/, 'Գաղտնաբառը պետք է պարունակի փոքրատառ')
    .matches(/\w*[A-Z]\w*/, 'Գաղտնաբառը պետք է պարունակի մեծատառ')
    .matches(/\d/, 'Գաղտնաբառը պետք է պարունակի թիվ')
    .matches(/[!@#$?%^&*()\-_"=+{}; :,<.>]/, 'Գաղտնաբառը պետք է պարունակի հատուկ նշան')
    .min(8, ({ min }) => `Գաղտնաբառը պետք է լինի մեծ ${min}֊ից`)
    .required('Գաղտնաբառը պարտադիր է'),
  confirmPassword: Yup.string()
    .oneOf([Yup.ref('password')], 'Գաղտնաբառերը չեն համընկնում')
    .required('Գաղտնաբառի հաստատումը պարտադիր է'),
});
export const updateUserFormSchema = Yup.object().shape({
  firstname: Yup.string()
    .required('Անունը պարտադիր է')
    .min(3, 'Անունը պետք է ունենա առնվազն 3 տառ')
    .max(16, 'Անունը չպետք է լինի ավելի քան 16 տառ'),
  lastname: Yup.string()
    .required('Ազգանունը պարտադիր է')
    .min(3, 'Ազգանունը պետք է ունենա առնվազն 3 տառ')
    .max(26, 'Ազգանունը չպետք է լինի ավելի քան 26 տառ'),
  username: Yup.string()
    .required('Մուտքանունը պարտադիր է')
    .min(5, 'Մուտքանունը պետք է ունենա առնվազն 5 տառ')
    .max(16, 'Մուտքանունը չպետք է լինի ավելի քան 16 տառ')
    .matches(/^[a-zA-Z0-9]+$/, 'Մուտքանունը պետք է պարունակի միայն անգլերեն տառեր և թվեր'),
  phone: Yup.string()
    .required('Հեռախոսահամարը պարտադիր է')
    .min(9, 'Հեռախոսահամարը չի համապատասխանում ՀՀ ձևաչափին'),
});

export const createAndEditCategoryFormSchema = Yup.object().shape({
  title: Yup.string()
    .required('Անվանումը պարտադիր է')
    .min(2, 'Անունը պետք է ունենա առնվազն 2 տառ')
    .max(16, 'Անունը չպետք է լինի ավելի քան 16 տառ'),
  picture: Yup.mixed().required('Նկարը պարտադիր է'),
});

export const loginFormSchema = Yup.object().shape({
  username: Yup.string()
    .required('Մուտքանունը պարտադիր է')
    .min(5, 'Մուտքանունը պետք է ունենա առնվազն 5 տառ')
    .max(16, 'Մուտքանունը չպետք է լինի ավելի քան 16 տառ')
    .matches(/^[a-zA-Z0-9]+$/, 'Մուտքանունը պետք է պարունակի միայն անգլերեն տառեր և թվեր'),
  password: Yup.string()
    .matches(/\w*[a-z]\w*/, 'Գաղտնաբառը պետք է պարունակի փոքրատառ')
    .matches(/\w*[A-Z]\w*/, 'Գաղտնաբառը պետք է պարունակի մեծատառ')
    .matches(/\d/, 'Գաղտնաբառը պետք է պարունակի թիվ')
    .matches(/[!@#$?%^&*()\-_"=+{}; :,<.>]/, 'Գաղտնաբառը պետք է պարունակի հատուկ նշան')
    .min(8, ({ min }) => `Գաղտնաբառը պետք է լինի մեծ ${min}֊ից`)
    .required('Գաղտնաբառը պարտադիր է'),
});
